# -*- coding: utf-8 -*-

import time
import js2py

ss={
    'total': 20,'resultmsg': 'success', 'count': 20, 'resultcode': 200,
    'records': [
        {'SECNAME': '中国天楹', 'F016V': '南通市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1994-04-08', 'F024V': '水利、环境和公共设施管理业', 'SECCODE': '000035'},
        {'SECNAME': '东方盛虹', 'F016V': '苏州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '2000-05-29', 'F024V': '制造业', 'SECCODE': '000301'},
        {'SECNAME': '南京公用', 'F016V': '南京市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1996-08-06', 'F024V': '电力、热力、燃气及水生产和供应业', 'SECCODE': '000421'},
        {'SECNAME': '徐工机械', 'F016V': '徐州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1996-08-28', 'F024V': '制造业', 'SECCODE': '000425'},
        {'SECNAME': '四环生物', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1993-09-08', 'F024V': '制造业', 'SECCODE': '000518'},
        {'SECNAME': 'ST红太阳', 'F016V': '南京市', 'F004V': 'ST', 'F015V': '江苏', 'F002D': '1993-10-28', 'F024V': '制造业', 'SECCODE': '000525'},
        {'SECNAME': '创元科技', 'F016V': '苏州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1994-01-06', 'F024V': '综合', 'SECCODE': '000551'},
        {'SECNAME': '苏常柴Ａ', 'F016V': '常州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1994-07-01', 'F024V': '制造业', 'SECCODE': '000570'},
        {'SECNAME': '威孚高科', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1998-09-24', 'F024V': '制造业', 'SECCODE': '000581'},
        {'SECNAME': '哈工智能', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1995-11-28', 'F024V': '制造业', 'SECCODE': '000584'},
        {'SECNAME': '远大控股', 'F016V': '连云港市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1996-11-28', 'F024V': '批发和零售业', 'SECCODE': '000626'},
        {'SECNAME': '视觉中国', 'F016V': '常州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-01-21', 'F024V': '文化、体育和娱乐业', 'SECCODE': '000681'},
        {'SECNAME': '模塑科技', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-02-28', 'F024V': '制造业', 'SECCODE': '000700'},
        {'SECNAME': '冠捷科技', 'F016V': '南京市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-05-20', 'F024V': '制造业', 'SECCODE': '000727'}, {'SECNAME': '航发控制', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-06-26', 'F024V': '制造业', 'SECCODE': '000738'}, {'SECNAME': '中核科技', 'F016V': '苏州市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-07-10', 'F024V': '制造业', 'SECCODE': '000777'}, {'SECNAME': '智慧农业', 'F016V': '盐城市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1997-08-18', 'F024V': '制造业', 'SECCODE': '000816'}, {'SECNAME': '法尔胜', 'F016V': '无锡市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1999-01-19', 'F024V': '制造业', 'SECCODE': '000890'}, {'SECNAME': '大亚圣象', 'F016V': '镇江市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1999-06-30', 'F024V': '制造业', 'SECCODE': '000910'}, {'SECNAME': '金陵药业', 'F016V': '南京市', 'F004V': '正常上市', 'F015V': '江苏', 'F002D': '1999-11-18', 'F024V': '制造业', 'SECCODE': '000919'}
    ]
}

# 'F016V': '南京市', 'F004V': '正常上市', 'F015V': '江苏',  }
records=ss['records']
for record in records:
    res = f"{record['SECCODE']} {record['SECNAME']} {record['F024V']} {record['F002D']} {record['F004V']} {record['F015V']} {record['F016V']}"
    print(res)